{
  "font_family": "Arial",
  "font_size": "10px",
  "_top": "0",
  "velocity": "50",
  "news": [
    {
      "data": "14.06.2017",
      "subject": "Microsoft намерена деактивировать сетевой протокол <yelw>SMB</yelw> (Server Message Block), предназначенного для удаленного доступа к сетевым ресурсам и межпроцессного взаимодействия. Это связано с обнародованием хакерской группировкой The Shadow Brokers инструментов взлома Windows, использующих уязвимости SMB."
    },
    {
      "data": "22.01.2017",
      "subject": "<grn>Nessus Vulnerability Scanner</grn> - лучший бесплатный сканер уязвимостей 2017 года, разработанный компанией <mgnt>Tenable Network Security</mgnt>."
    },
    {
      "data": "22.01.2017",
      "subject": "<grn>Nmap</grn>, также известный как <grn>Network Mapper</grn> - это наиболее популярный бесплатный инструмент хакинга для сканирования портов. Он обеспечивает эффективное обнаружение сети и контроль системы защиты. За последний год <grn>Nmap</grn> выиграл несколько наград в области безопасности и был показан в таких фильмах, как «Матрица: Перезагрузка», «Крепкий Орешек 4» и др."
    },
    {
      "data": "23.01.2017",
      "subject": "По результатам опроса, проведенного аналитической группой DOU (https://dou.ua), в 2017 году самым распространенным языком остается Java (23% рынка), хотя доля этого языка программирования сокращается; продолжает набирать популярность JavaScript (16%), на третьем - C#. Четвертое место занимает — PHP (13%) с большим отрывом от Python (7%). Программирование на C++ занимает 5% рынка, далее идут Ruby (4.5%), Swift и Objective-C. В опросе приняло участие 8186 человек, 90% участников проживают в Украине. 65% разработчиков хотят в следующем году выучить какой-то новый язык. Наиболее притягательным для изучения считается JavaScript (12%), затем Python, Java, Go, Scala и Swift."
    },
    {
      "data": "25.12.2016",
      "subject": "По данным опроса более чем 1300 программистов из 27 стран Европы, проведенному компанией <mgnt>O'Reilly</mgnt> в конце 2016 года, самым популярным языком стал <yelw>JavaScript</yelw>."
    },
    {
      "data": "25.12.2016",
      "subject": "<yelw>JavaScript</yelw> сохраняет лидирующие позиции в рейтинге аналитической компании <mgnt>RedMonk</mgnt>, вторую и третью позицию занимают <yelw>Java</yelw> и <yelw>PHP</yelw>"
    },
    {
      "data": "25.12.2016",
      "subject": "Согласно рейтингу популярности языков программирования журнала <mgnt>IEEE Spectrum</mgnt>, издаваемого Институтом инженеров электротехники и электроники (IEEE), лидирующие позиции занимает язык <yelw>С</yelw>, за которым следуют <yelw>Java</yelw>, <yelw>Python</yelw> и <yelw>C++</yelw>"
    },
    {
      "data": "25.12.2016",
      "subject": "В рейтинге популярности языков программирования от компании <mgnt>TIOBE Software</mgnt> отмечен рост популярности языка <yelw>ассемблер</yelw>, который переместился с 12 на 10 место."
    },
    {
      "data": "25.12.2016",
      "subject": "По данным рейтинга <mgnt>TIOBE Software</mgnt>, наблюдается рост популярности языков <yelw>Python</yelw> (с 5 на 4 место), <yelw>PHP</yelw> (с 7 на 6 место), <yelw>JavaScript</yelw> (с 9 на 7 место)."
    },
    {
      "data": "25.12.2016",
      "subject": "В 2016 году основные JS-движки достигли невероятной производительности, и скорость выполнения веб-приложений стала не ниже, чем нативных."
    },
    {
      "data": "25.12.2016",
      "subject": "Разработчики JavaScript-движка <grn>V8</grn> сообщили о реализации экспериментальной поддержки <yelw>WebAssembly</yelw> (WASM) для выполнения в браузере приложений, скомпилированных из различных языков программирования."
    }
  ]
}