{
  "font_family": "Arial",
  "font_size": "10px",
  "_top": "0",
  "velocity": "50",
  "news": [
    {
      "data": "25.12.16",
      "subject": "Согласно рейтингу языков программирования от аналитической компании <a href='http://redmonk.com/blog/2016/11/22/the-redmonk-programming-language-rankings-january-2016/' target='_blank'><mgnt>RedMonk</mgnt></a>, самыми популярными среди разработчиков продолжают быть <yelw>JavaScript</yelw>, <yelw>Java</yelw> и <yelw>php</yelw>"
    },
    {
      "data": "25.12.16",
      "subject": "Рейтинг <mgnt>RedMonk</mgnt> строится на основании частоты упоминаний языка на <grn>StackOverflow</grn> и его популярности на <grn>Github</grn>"
    },
    {
      "data": "25.12.16",
      "subject": "<yelw>JavaScript</yelw> сохраняет свои лидерские позиции в рейтинге <mgnt>RedMonk</mgnt>, вторую и третью позицию занимают <yelw>Java</yelw> и <yelw>PHP</yelw>"
    },
    {
      "data": "25.12.16",
      "subject": "Журнал <mgnt>IEEE Spectrum</mgnt>, издаваемый Институтом инженеров электротехники и электроники (IEEE), опубликовал собственный рейтинг популярности языков программирования. Лидирует в рейтинге язык программирования <yelw>С</yelw>, за которым с небольшим отставанием следуют <yelw>Java</yelw>, <yelw>Python</yelw> и <yelw>C++</yelw>"
    },
    {
      "data": "25.12.16",
      "subject": "В рейтинге популярности языков программирования от компании <mgnt>TIOBE Software</mgnt> отмечен рост популярности языка <yelw>ассемблер</yelw>, который переместился с 12 на 10 место."
    },
    {
      "data": "25.12.16",
      "subject": "По данным рейтинга <mgnt>TIOBE Software</mgnt>, наблюдается рост популярности языков <yelw>Python</yelw> (с 5 на 4 место), <yelw>PHP</yelw> (с 7 на 6 место), <yelw>JavaScript</yelw> (с 9 на 7 место)."
    },
    {
      "data": "25.12.16",
      "subject": "Рост популярности <yelw>JavaScript</yelw>, очевидно, связан с ростом производительности движков <yelw>JavaScript</yelw>, которые поставляются с компиляторами, генерирующими высокооптимизированный машинный код. В 2016 году основные JS-движки достигли невероятной производительности, и скорость выполнения веб-приложений стала не ниже, чем нативных."
    },
    {
      "data": "25.12.16",
      "subject": "Разработчики JavaScript-движка <grn>V8</grn> сообщили о реализации экспериментальной поддержки <yelw>WebAssembly</yelw> (WASM) для выполнения в браузере приложений, скомпилированных из различных языков программирования."
    }
  ]
}